notes.org
#+Hugo_base_dir: .
#+options: author:Aimee

** Project: The Big Announcement  :substrate:ethereum:smartcontract:@hacking:
:PROPERTIES:
:EXPORT_FILE_NAME: bigannouncement
:EXPORT_DATE: 2020-12-07
:EXPORT_HUGO_SECTION: hacking
:EXPORT_DESCRIPTION: A tiny smart contract.
:EXPORT_OPTIONS: toc:2
:END:

*** Project intro and status

The Big Announcement project on different chains.

TODO:
- [ ] TBA on Substrate (WIP)
- [ ] TBA on Solana (WIP)
- [ ] TBA on NEAR
- [ ] TBA on Nervos
- [ ] TBA on Aleo
- [ ] TBA on Concordium

*** TBA on Ethereum

- Source code: [[https://github.com/Aimeedeer/bigannouncement][bigannouncement.eth]]
  - [[https://github.com/Aimeedeer/bigannouncement/blob/master/contracts/BigAnnouncement.sol][Solidity contract]]
- Ethereum [[https://github.com/Aimeedeer/bigannouncement/blob/master/doc/hacklog.md][Hacklog]]

*** TBA on Substrate

**** Ink code

[[https://github.com/Aimeedeer/tba-substrate][tba-substrate]]

**** Substrate Hacklog

***** Contract naming

#+begin_src shell
$ cargo contract new bigannouncement-substrate
ERROR: Contract names cannot contain hyphens
#+end_src

New name: tbaSubstrate ;)

#+begin_src shell
$ cargo contract new tbaSubstrate
	Created contract tbaSubstrate
#+end_src

But Rust seems doesn't like it:

#+begin_src shell
warning: crate `tbaSubstrate` should have a snake case name
  |
  = note: `#[warn(non_snake_case)]` on by default
  = help: convert the identifier to snake case: `tba_substrate`
#+end_src 

My mood is just like this post: [[https://fasterthanli.me/articles/frustrated-its-not-you-its-rust][Frustrated? It's not you, it's Rust]]

***** Failed of using ~ink_prelude~

I use ~cargo add ink_prelude~, and it shows in the ~Cargo.toml~ as 

#+begin_src rust
ink_prelude = "0.0.0"
#+end_src

But the [[https://github.com/paritytech/ink/commit/75d3b99c3b86398acaef74b84e441da79a88c53f][newest released version]] is different, and I change it to 

#+begin_src rust
ink_prelude = "3.0.0-rc2"
#+end_src

Then build it, and there is a new error:

#+begin_src shell
$ cargo +nightly contract build
 [1/3] Building cargo project
   Compiling ink_prelude v3.0.0-rc2
   Compiling ink_primitives v3.0.0-rc2
error[E0463]: can't find crate for `std`
  |
  = note: the `wasm32-unknown-unknown` target may not be installed

error: aborting due to previous error

For more information about this error, try `rustc --explain E0463`.
error: could not compile `ink_prelude`
#+end_src

Keep trying:

#+begin_src shell
$ rustup install nightly-2020-10-06
info: syncing channel updates for 'nightly-2020-10-06-x86_64-apple-darwin'
info: latest update on 2020-10-06, rust version 1.49.0-nightly (a1dfd2490 2020-10-05)
...

$ rustup target add wasm32-unknown-unknown --toolchain nightly-2020-10-06
info: downloading component 'rust-std' for 'wasm32-unknown-unknown'
info: installing component 'rust-std' for 'wasm32-unknown-unknown'
info: using up to 500.0 MiB of RAM to unpack components
Aimees-MacBook-Pro:tbaSubstrate aimeez$ cargo +nightly-2020-10-06 build --release

...

warning: unused imports: `format`, `string`
 --> lib.rs:4:19
  |
4 | use ink_prelude::{format, string};
  |                   ^^^^^^  ^^^^^^
  |
  = note: `#[warn(unused_imports)]` on by default

warning: 1 warning emitted

    Finished release [optimized] target(s) in 1m 24s

$ cargo contract build && cargo contract generate-metadata
 [1/3] Building cargo project
   Compiling ink_prelude v3.0.0-rc2
error[E0463]: can't find crate for `std`
  |
  = note: the `wasm32-unknown-unknown` target may not be installed

error: aborting due to previous error

For more information about this error, try `rustc --explain E0463`.
error: could not compile `ink_prelude`
#+end_src

At last, I use ~alloc~ instead of ~ink_prelude~:

#+begin_src rust
use alloc::{string::String, format};
#+end_src

It built.

***** Deploy failed:

#+begin_src shell
system.ExtrinsicFailed
#+end_src

***** Run Rust test command

#+begin_src shell
$ cargo +nightly test -- new_works # test new an instance
#+end_src

#+begin_src shell
$ RUST_BACKTRACE=1 cargo +nightly test -- new_works
#+end_src

***** Debug_println

#+begin_src rust
let message = String::from("Initialize the Big Announcement contract");
ink_env::debug_println(&format!("thanks for instantiation {:?}, and price {}", &message, price));
#+end_src

#+begin_src shell
$ cargo +nightly test -- --nocapture

    Finished test [unoptimized + debuginfo] target(s) in 0.08s
     Running target/debug/deps/tba_substrate-6d0825befe66c5c8

running 2 tests
thanks for instantiation "Initialize the Big Announcement contract", and price 340282366920938463463374607431768211455
thanks for instantiation "Initialize the Big Announcement contract", and price 1
Thanks for posting the message "new message"
test tba_substrate::tests::new_works ... ok
test tba_substrate::tests::set_works ... ok

test result: ok. 2 passed; 0 failed; 0 ignored; 0 measured; 0 filtered out
#+end_src

#+begin_src shell
$ cargo +nightly test -- --nocapture set_works
#+end_src

***** Test ink's example: contract-transfer

#+begin_src rust
#[ink::test]
fn transfer_works() {
    // given
    let contract_balance = 100;
    let accounts = default_accounts();
    let mut give_me = create_contract(contract_balance);

    println!("alice: {}", get_balance(accounts.alice));
    // when
    set_sender(accounts.eve);
    set_balance(accounts.eve, 0);
    println!("eve: {}", get_balance(accounts.eve));
    assert_eq!(give_me.give_me(80), Ok(()));

    println!("eve after: {}", get_balance(accounts.eve));
    println!("alice after: {}", get_balance(accounts.alice));

    // then
    assert_eq!(get_balance(accounts.eve), 80);
}
#+end_src

The printing shows that alice's balance didn't change 
while eve's balance changed.

#+begin_src shell
$ cargo +nightly test -- --nocapture transfer_works
running 1 test
alice after: 170141183460469231731687303715884105727
eve: 0
eve after: 80
alice after: 170141183460469231731687303715884105727
test give_me::tests::transfer_works ... ok
#+end_src 


*** TBA on Dfinity

**** Motoko code

[[https://github.com/brson/rust-contract-comparison/tree/master/code/tba-dfinty/tba-motoko][TBA Motoko]]

