content/hacking/bigannouncement.md


### Using Rust to write TBA {#using-rust-to-write-tba}

Official tutorials: [Using Rust](https://sdk.dfinity.org/docs/developers-guide/work-with-languages.html)

I'm glad I can use Rust command directly to create a project.
But, that's all.

```shell
$ cargo new tba_rust
     Created binary (application) `tba_rust` package
Aimees-MacBook-Pro:dfinity-project aimeez$ cd tba_rust/
Aimees-MacBook-Pro:tba_rust aimeez$ dfx build
Command must be run in a project directory (with a dfx.json file).
Aimees-MacBook-Pro:tba_rust aimeez$ cargo build
   Compiling tba_rust v0.1.0 (/<my_path>/tba_rust)
    Finished dev [unoptimized + debuginfo] target(s) in 3.51s
```

Then I need to copy `Cargo.toml` to another place according the tutorials:

> Projects that run on the Internet Computer typically use
one project-level `Cargo.toml` file to set up a workspace
for the canister members of the project and a second `Cargo.toml` file
in the source code directory to configure settings for each canister.

After finishing the basic round of configuration, I use `cargo build`
and there is an error:

```shell
$ cargo build
error: failed to read `/<my_path>/tba_rust/src/tba_rust/Cargo.toml`

Caused by:
  No such file or directory (os error 2)
```

The path is incorrect, and I change it in the root `Cargo.toml` file:

```rust
[workspace]
members = [
    "src/",
]
```

`cargo build` works but `dfx build` doesn't work (I have started `dfx start`
in another terminal window). The error is:

```shell
$ cargo build
   Compiling tba_rust v0.1.0 (/<my_path>/tba_rust/src)

$ dfx build
Building canisters...
Executing 'cargo build --target wasm32-unknown-unknown --package tba_rust'
   Compiling tba_rust v0.1.0 (/<my_path>/tba_rust/src)
warning: function is never used: `main`
 --> src/main.rs:1:4
  |
1 | fn main() {
  |    ^^^^
  |
  = note: `#[warn(dead_code)]` on by default

warning: 1 warning emitted

    Finished dev [unoptimized + debuginfo] target(s) in 0.23s
The post-build step failed for canister 'rwlgt-iiaaa-aaaaa-aaaaa-cai' with an embedded error: No such file or directory (os error 2)
```

However, the config
`members = ["src/",]`
isn't right according to Rust configuration.
I create another folder `tba_rust` under `/<my_path>/tba_rust/src/`,
and move all the files from `src` to `src/tba_rust`.
Then I add `cdylib` to my `/<my_path>/tba_rust/src/Cargo.toml` file.

```rust
[lib]
path = "main.rs"
crate-type = ["cdylib"]
```

Now both `cargo build` and `dfx build` work.
The terminal prints:

```shell
$ dfx build
Building canisters...
Executing 'cargo build --target wasm32-unknown-unknown --package tba_rust'
   Compiling tba_rust v0.1.0 (/<my_path>/tba_rust/src/tba_rust)
warning: function is never used: `main`
 --> src/tba_rust/main.rs:1:4
  |
1 | fn main() {
  |    ^^^^
  |
  = note: `#[warn(dead_code)]` on by default

warning: 1 warning emitted

    Finished dev [unoptimized + debuginfo] target(s) in 1.37s
```

**The documentation has been misguiding so far.**

Deploy it:

```shell
$ dfx canister install --all
Installing code for canister tba_rust, with canister_id rwlgt-iiaaa-aaaaa-aaaaa-cai
The Replica returned an error: code 5, message: "Canister rwlgt-iiaaa-aaaaa-aaaaa-cai cannot be installed because the canister is not empty. Try installing with mode='reinstall' instead."

$ dfx canister install --mode reinstall
error: The following required arguments were not provided:
    --all

USAGE:
    dfx canister install --mode <mode> --all

For more information try --help

$ dfx canister install --mode reinstall --all
Installing code for canister tba_rust, with canister_id rwlgt-iiaaa-aaaaa-aaaaa-cai
```

I am not going to move forward since there is no more tutorials about Rust programming on Dfinity.


### Dfinity references {#dfinity-references}

[A Technical Overview of the Internet Computer](https://medium.com/dfinity/a-technical-overview-of-the-internet-computer-f57c62abc20f)

[The Internet Computer’s Token Economics: An Overview](https://medium.com/dfinity/the-internet-computers-token-economics-an-overview-29e238bd1d83)

> You can do two things with ICP tokens:
>
> -  Lock them inside the NNS to create “neurons,” which can vote on proposals and earn voting rewards.
> -  Convert them into cycles, which are used to power computation by software canisters running on the Internet Computer.
>
> Cycles
>
> Software canisters that run on the Internet Computer must be charged with cycles, which are used to
power computations and memory management, and are burned in the process.
The conversion of ICP tokens to cycles occurs at a variable rate, which is
constantly configured by the NNS in response to external markets.

[Sample Apps](https://sdk.dfinity.org/docs/developers-guide/sample-apps.html)

[Dfinity Motoko Programming Language](https://sdk.dfinity.org/docs/language-guide/motoko.html)

> Motoko lets you declare certain variables as `stable`.
The values of `stable` variables are automatically preserved across software upgrades.

It's weird to use another name `stable` to replace a name that is in consensus `static`.

[Candid Specification](https://sdk.dfinity.org/docs/candid-spec/idl)

It brings some design thoughts, especially the section [Services](https://sdk.dfinity.org/docs/candid-spec/idl#%5Fservices).
An interesting read.

[Using Rust](https://sdk.dfinity.org/docs/developers-guide/work-with-languages.html)

[Crate candid](https://docs.rs/candid/0.6.13/candid/)

Forum post: [Developer Experience, January 2021](https://forum.dfinity.org/t/developer-experience-january-2021/1749)
