notes.org
*** TBA on Aleo

TODO:
- [ ] Next, change the default code: https://developer.aleo.org/developer/getting_started/syntax
- [ ] Create TBA program

