content/hacking/bigannouncement.md


## TBA on Aleo {#tba-on-aleo}

TODO:

-   [ ] Next, change the default code: <https://developer.aleo.org/developer/getting%5Fstarted/syntax>
-   [ ] Create TBA program
