notes.org
**** Aleo references

- Doc: https://developer.aleo.org/aleo/getting_started/overview/
- SDK: https://github.com/AleoHQ/aleo
- Package manager: https://aleo.pm/
- Node: https://github.com/AleoHQ/snarkOS
- VM: https://github.com/AleoHQ/snarkVM


