content/hacking/bigannouncement.md


### Aleo references {#aleo-references}

-   Doc: <https://developer.aleo.org/aleo/getting%5Fstarted/overview/>
-   SDK: <https://github.com/AleoHQ/aleo>
-   Package manager: <https://aleo.pm/>
-   Node: <https://github.com/AleoHQ/snarkOS>
-   VM: <https://github.com/AleoHQ/snarkVM>